//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************


//
// @file  BmcLanConfig.uni
//
//  String definitions for BMC Network Configuration Page.
//

#langdef   en-US "English"    // English
#langdef   x-UEFI-AMI "x-UEFI-AMI"    // AMI Mapping Language

//
// Last added Mapping language tag "IPMI506"
//

#string STR_NULL_STRING                              #language en-US ""
#string STR_UNKNOWN_STRING                           #language en-US "-"

#string STR_BMC_NETWORK_TITLE                        #language en-US "BMC network configuration"
#string STR_BMC_NETWORK_SUB_TITLE                    #language en-US "--BMC network configuration--"
#string STR_BMC_NETWORK_HELP                         #language en-US "Configure BMC network parameters"
#string STR_IP_BMC_STAR_SEPARATOR                    #language en-US "**********************"
#string STR_IP_BMC_NETWORK_SUB_TITLE                 #language en-US "Configure IPv4 support"
#string STR_IP6_BMC_NETWORK_SUB_TITLE                #language en-US "Configure IPv6 support"
#string STR_IP6_BMC_NOT_SUPPORTED                    #language en-US "IPv6 is not supported in BMC"
#string STR_IP6_SUPPORT_DISABLED                     #language en-US "IPV6 Support is Disabled"
#string STR_LAN_OPTION_HELP                          #language en-US "Select to configure LAN channel parameters statically or dynamically(by BIOS or BMC). Unspecified option will not modify any BMC network parameters during BIOS phase"
#string STR_CURR_LAN_OPTION_HELP                     #language en-US "Current LAN Configuration statically or dynamically(by BIOS or BMC). Unspecified for not Configured address space"
#string STR_LAN_CHANNEL_1                            #language en-US "Lan channel 1"
#string STR_LAN_CHANNEL_2                            #language en-US "Lan channel 2"
#string STR_LAN_ROUTEER_OPTION_HELP                  #language en-US "Select to configure LAN channel parameters statically or dynamically(by BIOS or BMC). Unspecified option will not modify any BMC network parameters during BIOS phase"

#string STR_IPV4_LAN1_OPTION                         #language en-US "Configuration Address source"
                                                     #language x-UEFI-AMI "IPMI500"
#string STR_STATION_IP_ADDRESS_LAN1                  #language en-US "Station IP address"
                                                     #language x-UEFI-AMI "IPMI501"
#string STR_SUBNET_MASK_LAN1                         #language en-US "Subnet mask"
                                                     #language x-UEFI-AMI "IPMI502"
#string STR_ROUTER_IP_ADDRESS_LAN1                   #language en-US "Router IP address"
                                                     #language x-UEFI-AMI "IPMI503"
#string STR_ROUTER_MAC_ADDRESS_LAN1                  #language en-US "Router MAC address"
                                                     #language x-UEFI-AMI "IPMI504"

#string STR_IPV4_LAN2_OPTION                         #language en-US "Configuration Address source"
                                                     #language x-UEFI-AMI "IPMI505"
#string STR_STATION_IP_ADDRESS_LAN2                  #language en-US "Station IP address"
                                                     #language x-UEFI-AMI "IPMI506"
#string STR_SUBNET_MASK_LAN2                         #language en-US "Subnet mask"
                                                     #language x-UEFI-AMI "IPMI507"
#string STR_ROUTER_IP_ADDRESS_LAN2                   #language en-US "Router IP address"
                                                     #language x-UEFI-AMI "IPMI508"
#string STR_ROUTER_MAC_ADDRESS_LAN2                  #language en-US "Router MAC address"
                                                     #language x-UEFI-AMI "IPMI509"

#string STR_IPV6_OPTION_LAN1                         #language en-US "IPv6 Support"
                                                     #language x-UEFI-AMI "IPMI510"
#string STR_IPV6_LAN1_OPTION                         #language en-US "Configuration Address source"
                                                     #language x-UEFI-AMI "IPMI511"
#string STR_STATION_IP6_ADDRESS_LAN1                 #language en-US "Station IPv6 address"
                                                     #language x-UEFI-AMI "IPMI512"
#string STR_STATION_IP6_ADDRESS_PREFIX_LENGTH_LAN1   #language en-US "Prefix Length"
                                                     #language x-UEFI-AMI "IPMI513"
#string STR_STATION_IP6_ROUTER_ADDRESS_LAN1          #language en-US "IPv6 Router1 IP Address"
                                                     #language x-UEFI-AMI "IPMI514"

#string STR_IPV6_OPTION_LAN2                         #language en-US "IPv6 Support"
                                                     #language x-UEFI-AMI "IPMI515"
#string STR_IPV6_LAN2_OPTION                         #language en-US "Configuration Address source"
                                                     #language x-UEFI-AMI "IPMI516"
#string STR_STATION_IP6_ADDRESS_LAN2                 #language en-US "Station IPv6 address"
                                                     #language x-UEFI-AMI "IPMI517"
#string STR_STATION_IP6_ADDRESS_PREFIX_LENGTH_LAN2   #language en-US "Prefix Length"
                                                     #language x-UEFI-AMI "IPMI518"
#string STR_STATION_IP6_ROUTER_ADDRESS_LAN2          #language en-US "IPv6 Router1 IP Address"
                                                     #language x-UEFI-AMI "IPMI519"
#string STR_STATION_IP6_ROUTER_PREFIX_LENGTH_LAN1    #language en-US "IPv6 Router1 Prefix Length Lan1"
                                                     #language x-UEFI-AMI "IPMI520"
#string STR_STATION_IP6_ROUTER_PREFIX_VALUE_LAN1     #language en-US "IPv6 Router1 Prefix Value Lan1"
                                                     #language x-UEFI-AMI "IPMI521"
#string STR_IPV6_ROUTER_LAN1_OPTION                  #language en-US "Configuration Router Lan1 Address source"
                                                     #language x-UEFI-AMI "IPMI522"
#string STR_STATION_IP6_ROUTER_PREFIX_LENGTH_LAN2    #language en-US "IPv6 Router1 Prefix Length Lan2"
                                                     #language x-UEFI-AMI "IPMI523"
#string STR_STATION_IP6_ROUTER_PREFIX_VALUE_LAN2     #language en-US "IPv6 Router1 Prefix Value Lan2"
                                                     #language x-UEFI-AMI "IPMI524"
#string STR_IPV6_ROUTER_LAN2_OPTION                  #language en-US "Configuration Router Lan2 Address source"
                                                     #language x-UEFI-AMI "IPMI525"


#string STR_CURR_LAN_OPTION                          #language en-US "Current Configuration Address source"
#string STR_CURR_STATION_IP_ADDRESS                  #language en-US "Station IP address"
#string STR_CURR_SUBNET_MASK                         #language en-US "Subnet mask"
#string STR_STATION_MAC_ADDRESS                      #language en-US "Station MAC address"
#string STR_CURR_ROUTER_IP_ADDRESS                   #language en-US "Router IP address"
#string STR_CURR_ROUTER_MAC_ADDRESS                  #language en-US "Router MAC address"

#string STR_IP6_CURR_LAN_OPTION                      #language en-US "Current Configuration Address source"
#string STR_IP6_CURR_ROUTER_LAN_OPTION               #language en-US "Current Router Configuration Address source"
#string STR_CURR_STATION_IP6_ADDRESS                 #language en-US "Station IPv6 address"
#string STR_CURR_STATION_IP6_ADDRESS_PREFIX_LENGTH   #language en-US "Prefix Length"
#string STR_CURR_STATION_IP6_ROUTER_ADDRESS          #language en-US "IPv6 Router IP Address"
#string STR_CURR_STATION_IP6_ROUTER_LENGTH          #language en-US "IPv6 Router Prefix Length"
#string STR_CURR_STATION_IP6_ROUTER_VALUE          #language en-US "IPv6 Router Prefix Value"

#string STR_STATION_IP_HELP                          #language en-US "Enter station IP address"
#string STR_SUBNET_MASK_HELP                         #language en-US "Enter subnet mask"
#string STR_ROUTER_IP_HELP                           #language en-US "Enter router IP address"
#string STR_ROUTER_MAC_HELP                          #language en-US "Enter router MAC address"

#string STR_IP6_CURR_LAN_OPTION_HELP                 #language en-US "Current IPv6 LAN Configuration statically or dynamically by BMC). Unspecified for not Configured address space"
#string STR_IP6_CURR_ROUTER_LAN_OPTION_HELP          #language en-US "Current IPv6 Router LAN Configuration statically or dynamically by BMC). Unspecified for not Configured address space"
#string STR_IPV6_OPTION_HELP_LAN1                    #language en-US "Enable or Disable LAN1 IPv6 Support"
#string STR_IPV6_OPTION_HELP_LAN2                    #language en-US "Enable or Disable LAN2 IPv6 Support"


#string STR_UNSPECIFIED                              #language en-US "Unspecified"
#string STR_BIOS_STATIC                              #language en-US "Static"
#string STR_BMC_DYNAMIC                              #language en-US "DynamicBmcDhcp"
#string STR_BMC_ADDR_PROTOCOL                        #language en-US "DynamicBmcNonDhcp"

#string STR_CURR_LANCAS1_VAL                         #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI526"
#string STR_CURR_LANCAS2_VAL                         #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI527"
#string STR_STATION_IP1_VAL                          #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI528"
#string STR_STATION_IP2_VAL                          #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI529"
#string STR_BMC_STATION_IP_HELP                      #language en-US  "Station IP address from BMC"
#string STR_STATION_MAC1_VAL                         #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI530"
#string STR_STATION_MAC2_VAL                         #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI531"
#string STR_BMC_STATION_MAC_ADDRESS                  #language en-US  "Station MAC address from BMC"
#string STR_SUBNET_MASK1_VAL                         #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI532"
#string STR_SUBNET_MASK2_VAL                         #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI533"
#string STR_BMC_SUBNET_MASK_HELP                     #language en-US  "Subnet mask from BMC"
#string STR_ROUTER_IP1_VAL                           #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI534"
#string STR_ROUTER_IP2_VAL                           #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI535"
#string STR_BMC_ROUTER_IP_HELP                       #language en-US  "Router IP address from BMC"
#string STR_ROUTER_MAC1_VAL                          #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI536"
#string STR_ROUTER_MAC2_VAL                          #language en-US  "-"
                                                     #language x-UEFI-AMI "IPMI537"
#string STR_BMC_ROUTER_MAC_HELP                      #language en-US  "Router MAC address from BMC"

#string STR_STATION_IP_ADDRESS_DEFAULT               #language en-US "0.0.0.0"
#string STR_ROUTER_IP_ADDRESS_DEFAULT                #language en-US "0.0.0.0"
#string STR_SUBNET_MASK_DEFAULT                      #language en-US "0.0.0.0"
#string STR_ROUTER_MAC_ADDRESS_DEFAULT               #language en-US "00-00-00-00-00-00"

#string STR_STATION_IP6_ADDRESS_DEFAULT              #language en-US ":::::::"

#string STR_IP6_CURR_LANCAS1_VAL                     #language en-US  "-"
#string STR_IP6_CURR_LANCAS2_VAL                     #language en-US  "-"
#string STR_IP6_CURR_ROUTER_LANCAS1_VAL              #language en-US  "-"
#string STR_IP6_CURR_ROUTER_LANCAS2_VAL              #language en-US  "-"

#string STR_STATION_IP6_HELP                         #language en-US "Enter station IPv6 address"
#string STR_STATION_IP6_LAN1_VAL                     #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI538"
#string STR_STATION_IP6_LAN2_VAL                     #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI539"

#string STR_STATION_IP6_ADD_STATUS                   #language en-US "IPv6 address status"
#string STR_STATION_IP6_ADD_STATUS_HELP              #language en-US "Status of station IPv6 address to BMC."
#string STR_STATION_IP6_LAN1_ADD_STATUS              #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI540"
#string STR_STATION_IP6_LAN2_ADD_STATUS              #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI541"

#string STR_STATION_IP6_DHCP_ALGO                    #language en-US "IPv6 DHCP Algorithm"
                                                     #language x-UEFI-AMI "IPMI542"
#string STR_STATION_IP6_DHCP_ALGO_HELP               #language en-US "Providing the DHCP method used like DHCPv6 or StateLess Address Auto Configuration(SLAAC)."
#string STR_STATION_IP6_LAN_DHCP_DHCP6               #language en-US "DHCPv6"
#string STR_STATION_IP6_LAN_DHCP_SLAAC               #language en-US "SLAAC"
#string STR_STATION_IP6_LAN1_DHCP_ALGO               #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI543"
#string STR_STATION_IP6_LAN2_DHCP_ALGO               #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI544"


#string STR_INVALID_STATION_IP                       #language en-US "Invalid Station IP Entered!!!"
#string STR_INVALID_BMC_IPV6_ADDRESS                 #language en-US "Invalid Station IPv6 value Entered!!!"
#string STR_INVALID_SUBNETMASK                       #language en-US "Invalid Subnet Mask Entered!!!"
#string STR_INVALID_ROUTER_IP                        #language en-US "Invalid Router IP Entered!!!"
#string STR_INVALID_ROUTER_MAC                       #language en-US "Invalid Router MAC Entered!!!"
#string STR_INVALID_STATIC_PREFIX_VALUE              #language en-US "Invalid Static Prefix Value!!!"
#string STR_BMCLAN_ERROR_INFO                        #language en-US "BMCLAN ERROR INFO"
#string STR_IPSOURCE_STATIC_ADDRESS                  #language en-US "StaticAddress"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_DHCP        #language en-US "DynamicAddressBmcDhcp"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BIOS_DHCP       #language en-US "DynamicAddressBiosDhcp"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_NON_DHCP    #language en-US "DynamicAddressBmcNonDhcp"
#string STR_IPSOURCE_UNSUPPORTED_ROUTER_INFO_SET     #language en-US "Not Supported for Dynamic" 

#string STR_BMC_IPV6_ADDRESS_STATUS_ACTIVE           #language en-US "Active"
#string STR_BMC_IPV6_ADDRESS_STATUS_DISABLE          #language en-US "Disabled"
#string STR_BMC_IPV6_ADDRESS_STATUS_PENDING          #language en-US "Pending"
#string STR_BMC_IPV6_ADDRESS_STATUS_FAILED           #language en-US "Failed"
#string STR_BMC_IPV6_ADDRESS_STATUS_DEPRECATED       #language en-US "Deprecated"
#string STR_BMC_IPV6_ADDRESS_STATUS_INVALID          #language en-US "Invalid"
#string STR_BMC_IPV6_ADDRESS_STATUS_RESERVED         #language en-US "Reserved"

#string STR_ENABLED                                  #language en-US "Enabled"
#string STR_DISABLED                                 #language en-US "Disabled"

#string STR_STATION_IP6_ADDRESS_PREFIX_LENGTH_HELP   #language en-US "Change the prefix length"
#string STR_STATION_IP6_LAN1_PREFIX_LENGTH_VAL       #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI545"
#string STR_STATION_IP6_LAN2_PREFIX_LENGTH_VAL       #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI546"

#string STR_STATION_IP6_ROUTER_ADDRESS_HELP          #language en-US "Change the IPv6 Router1 IP Address"
#string STR_STATION_IP6_ROUTER_ADDRESS1_VAL          #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI547"
#string STR_STATION_IP6_ROUTER_ADDRESS2_VAL          #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI548"
#string STR_STATION_IP6_ROUTER_ADDRESS_VAL           #language en-US "-"

#string STR_STATION_IP6_ROUTER_PREFIX_LENGTH_HELP    #language en-US "Change the IPv6 Router Prefix Length"
#string STR_STATION_IP6_ROUTER_PREFIX_LENGTH1_VAL    #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI549"
#string STR_STATION_IP6_ROUTER_PREFIX_LENGTH2_VAL    #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI550"
#string STR_STATION_IP6_ROUTER_PREFIX_LENGTH_VAL     #language en-US "-"

#string STR_STATION_IP6_ROUTER_PREFIX_VALUE_HELP     #language en-US "Change the IPv6 Router Prefix  Value"
#string STR_STATION_IP6_ROUTER_PREFIX_VALUE1         #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI551"
#string STR_STATION_IP6_ROUTER_PREFIX_VALUE2         #language en-US "-"
                                                     #language x-UEFI-AMI "IPMI552"
#string STR_STATION_IP6_ROUTER_PREFIX_VALUE          #language en-US "-"

